import streamlit as st
from openai import OpenAI
from parse_hh import get_html, extract_vacancy_data, extract_resume_data

# Инициализация OpenAI-клиента
client = OpenAI(api_key=st.secrets["OPENAI_API_KEY"]) 

SYSTEM_PROMPT = """
Рассчитай оценку от 1 до 10, насколько кандидат соответствует вакансии.
Проверь:
- совпадение роли/семейства должностей в cv и в вакансии;
- совпадение формата занятости (полная занятость/частичная занятость/удалённый формат); 
- пересечение ключевых навыков и стека. Если кандидат не указал навыки, то смотри, есть ли аналогичные обязанности в опыте работы;
- опыт работы кандидата (длительность и релевантность ролей);
- совпадение зарплатных ожиданий кандидата и вилки в вакансии. Если кандидат не указал зарплату, то кандидат может подойти;
- усиливающие сигналы (профильное образование, дополнительные релевантные навыки);
- качество оформления резюме.
Составь краткий аналитический комментарий, объясняющий твою оценку.
Представь итоговую оценку соответствия кандидата по шкале от 1 до 10.
""".strip()

def request_gpt(system_prompt, user_prompt):
    response = client.chat.completions.create(
        model="gpt-4.1-mini",
        messages=[
            {"role": "system", "content": system_prompt},  
            {"role": "user", "content": user_prompt},     
        ],
        max_tokens=1000,
        temperature=0,
    )
    return response.choices[0].message.content
# UI
st.title('CV Scoring App')
job_url = st.text_area('Введите ссылку на вакансию')
resume_url = st.text_area('Введите ссылку на резюме')
if st.button("Проанализировать соответствие"):
    with st.spinner("Парсим данные и отправляем в GPT..."):
        try:
            job_html = get_html(job_url).text
            resume_html = get_html(resume_url).text
            job_text = extract_vacancy_data(job_html)
            resume_text = extract_resume_data(resume_html)
            prompt = f"# ВАКАНСИЯ\n{job_text}\n\n# РЕЗЮМЕ\n{resume_text}"
            response = request_gpt(SYSTEM_PROMPT, prompt)
            st.subheader("📊 Результат анализа:")
            st.markdown(response)
        except Exception as e:
            st.error(f"Произошла ошибка: {e}")